---
type: VertexPair
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# VertexPair

`Autodesk.Revit.DB.VertexPair` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | VertexPair | 2012 | `public VertexPair ( int firstVertexIdx , int secondVertexIdx )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | First | 2012 | `public int First { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Second | 2012 | `public int Second { get ; set ; }` |